Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_179-Teaching_The_Relative_and_Ultimate_Truths-v1.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཀུན་རྫོབ་དང་དོན་དམ་པའི་བདེན་པ་བསྟན་པ
en: Teaching the Relative and Ultimate Truths

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན།
en: The Blessed One was dwelling in Rājagṛha,

source: བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་བརྒྱད་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་།
en: on Vulture Peak Mountain, together with a large monastic saṅgha of 8,000 monks

source: བྱང་ཆུབ་སེམས་དཔའ་བདུན་ཁྲི་ཉིས་སྟོང་དང་།
en: and 72,000 bodhisattvas,

source: འདོད་པ་ན་སྤྱོད་པ་དང་།
en: as well as gods living in the desire

source: གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: and form realms.

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏོ། །
en: There, the Blessed One taught the Dharma, surrounded and honored by a retinue of many hundreds of thousands of beings.

source: དེ་ནས་ལྷའི་བུ་རབ་ཏུ་ཞི་བ་རྣམ་པར་དུལ་བའི་དབང་ཕྱུག་ཅེས་བྱ་བ་འཁོར་དེར་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས།
en: Present in the assembly was a god, called Lord of Peace and Calm.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: He prostrated at the feet of the Blessed One and,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: bowing with joined palms in the direction of the Blessed One,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: asked the Blessed One,

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ད་ལྟར་གང་ན་མཆིས་
en: “Blessed One, where is Mañjuśrī Kumārabhuta now?

source: བཅོམ་ལྡན་འདས་བདག་དང་འཁོར་མང་པོ་འདི་རྣམས་ཀྱང་སྐྱེས་བུ་དམ་པ་དེས་ཆོས་བསྟན་པར་རབ་ཏུ་འཚལ་ལོ། །
en: Blessed One, I myself and everyone here would like that sublime being to teach the Dharma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: ལྷའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅོ་བརྒྱད་འདས་པ་ན།
en: “Divine son, if one travels east of this buddha realm and passes beyond 18,000 other buddha realms,

source: འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: there is a buddha realm called Jewel World.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱ་བ་ད་ལྟར་བཞུགས་པ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: There, the Thus-gone, worthy, perfect Buddha Ratnaketu at present lives and teaches the Dharma;

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའང་ད་ལྟར་དེ་ན་འདུག་གོ། །
en: and Mañjuśrī Kumārabhuta is there now.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ལྷའི་བུ་རབ་ཏུ་ཞི་བ་རྣམ་པར་དུལ་བའི་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The god Lord of Peace and Calm said to the Blessed One,

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཅི་ནས་དེ་མཚན་མ་རིག་པས་འདིར་མཆི་བར་སེམས་པ་དེ་ལྟ་བུའི་མཚན་མ་ཞིག་མཛད་ན་ལེགས་སོ། །
en: “Blessed One, it would be wonderful if a sign were made such that Mañjuśrī Kumārabhuta, upon seeing it, would wish to return here.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: The reason is,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལས་ཐོས་པ་ལྟ་བུར་ཉན་ཐོས་དང་
en: Blessed One, that Dharma teachings such as those of Mañjuśrī Kumārabhuta are not to be heard from any of the hearers,

source: རང་སངས་རྒྱས་ཐམས་ཅད་དང་།
en: solitary buddhas,

source: བྱང་ཆུབ་སེམས་དཔའ་དམིགས་པ་ཅན་རྣམས་ལས།
en: or those bodhisattvas who rely on reference points.

source: དེ་ལྟ་བུའི་ཆོས་བསྟན་པ་མི་ཐོས་ཏེ། དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་གཞན་སུ་ཡང་དེ་ལྟ་བུར་ཆོས་སྟོན་མི་ནུས་སོ། །
en: Except for the Thus-gone One, no one else at all is capable of teaching the Dharma in that manner.

source: བཅོམ་ལྡན་འདས་ནམ་འཇམ་དཔལ་ཆོས་སྟོན་པ་དེ་ན་བདུད་ཀྱི་ཁང་པ་ཐམས་ཅད་མོག་མོག་པོར་འགྱུར་རོ། །
en: Blessed One, when Mañjuśrī teaches the Dharma, all the dwellings of the demons lose their luster.

source: བདུད་ཐམས་ཅད་ཀྱིས་ཀྱང་གླགས་མི་རྙེད་དོ། །
en: Moreover, all demons become unable to inflict any harm.

source: ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་ཚར་ཆོད་པར་འགྱུར་རོ། །
en: All opposition is utterly defeated.

source: དམིགས་པ་ཅན་རྣམས་ཀྱང་དམིགས་པ་མ་མཆིས་པར་འགྱུར་རོ། །
en: Those with reference points are left without reference.

source: དམ་པའི་ཆོས་ཀྱང་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ། །
en: The sacred Dharma also remains for a long time.

source: དེ་བཞིན་གཤེགས་པ་ཡང་དེ་ལ་རྗེས་སུ་ཡི་རང་ཞིང་རབ་ཏུ་གཟུང་བ་མཛད་དོ། །
en: The Thus-gone One will also rejoice in this and approve of it.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་རབ་ཏུ་ཞི་བ་རྣམ་པར་དུལ་བའི་དབང་ཕྱུག་གསོལ་བ་འདེབས་པར་མཁྱེན་ནས།
en: The Blessed One knew that the god Lord of Peace and Calm would make this request,

source: ཞལ་གྱི་མཛོད་སྤུ་ནས་འོད་ཟེར་གཅིག་བཏང་སྟེ།
en: and sent out a beam of light from the ūrṇa hair on his brow.

source: དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བ་ཆེན་པོས་སྣང་བར་བྱས་ནས།
en: That ray of light illuminated the great trichiliocosm with its intense luminescence and,

source: སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅོ་བརྒྱད་པོ་དེ་དག་ལས་ཐལ་ཏེ།
en: passing through those 18,000 other buddha realms,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བ་དེ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ། །
en: its intense radiance spread throughout the Jewel World, the buddha realm of the Blessed, thus-gone, worthy, perfect Buddha Ratnaketu.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་བཞུགས་པ་ལ།
en: thus-gone, worthy, perfect Buddha Ratnaketu who resided there,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁ་ཅིག་གིས་གསོལ་པ།
en: Witnessing this radiance, some bodhisattva great beings asked the Blessed,

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་འོད་ཆེན་པོ་རབ་ཏུ་གདའ་བ་འདི་སུའི་ལྟས་སྔོན་དུ་བྱུང་བ་ལགས།
en: “Blessed One, there was such a bright light just now; who caused that sign?”

source: བཅོམ་ལྡན་འདས་རིན་པོ་ཆེའི་ཏོག་གིས་བཀའ་སྩལ་པ།
en: “Son of noble family,” replied the Blessed Ratnaketu,

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ནུབ་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅོ་བརྒྱད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: “to the west of this buddha realm, past 18,000 buddha realms, is the Sahā world.

source: དེ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ད་ལྟ་ན་བཞུགས་ཏེ།
en: There, the Blessed, thus-gone, worthy, perfect Buddha Śākyamuni currently

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: lives and teaches the Dharma.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེས་ཞལ་གྱི་མཛོད་སྤུ་ནས་འོད་ཟེར་གཅིག་བཏང་བས།
en: The Blessed, thus-gone, worthy, perfect Buddha Śākyamuni sent out a beam of light from the ūrṇa hair on his brow,

source: འོད་ཟེར་གྱི་སྣང་བ་དེས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅོ་བརྒྱད་ལས་ཐལ་ནས་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བ་ཆེན་པོས་སྣང་བར་བྱས་སོ། །
en: and the luminescence of that beam of light passed through 18,000 buddha realms and illuminated this world with its intense radiance.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་གསོལ་པ།
en: “Blessed One,” asked those bodhisattva great beings,

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་འོད་ཟེར་འདི་བཏང་།
en: “why did that blessed, thus-gone, worthy, perfect buddha emit this beam of light?”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྦྲན་པའི་ཕྱིར་རོ། །
en: “He did so in order to summon Mañjuśrī Kumārabhuta.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: And why?

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེར་འོང་བར་བྱ་བའི་ཕྱིར་ཏེ།
en: To make him return there.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བགྲང་བ་ལས་འདས་པ་རྣམས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་མང་པོ་ལ་སོགས་པ་འཁོར་དེར་ཚོགས་པ་དེ་དག་
en: In that buddha’s retinue there are numerous bodhisattva great beings as well as many gods, nāgas, yakṣas, gandharvas, and so forth.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བལྟ་བ་དང་། ཆོས་ཉན་པར་འདོད་དོ། །
en: They all want to behold Mañjuśrī Kumārabhuta and hear him teach the Dharma.”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་ཏོག་གིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Thus-gone Ratnaketu then said to Mañjuśrī Kumārabhuta,

source: འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དང་། འཁོར་དེ་དག་ཐམས་ཅད་ཁྱོད་ལ་ལྟ་འདོད་ཀྱིས།
en: “Mañjuśrī, since the Blessed, Thus-gone Śākyamuni and all those in his retinue would like to see you,

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་དེར་སོང་ཤིག །
en: you should go to that Sahā world.”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ།
en: “Yes, Blessed One,” replied Mañjuśrī.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ལྟས་སྔོན་དུ་བྱུང་བ་འདི་འཚལ་ཏོ། །
en: “I had also noticed that sign.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བཅུ་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་ཏོག་གི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: So Mañjuśrī Kumārabhuta, along with ten thousand bodhisattvas, bowed at the feet of the Thus-gone Ratnaketu.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་ལ་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས་འདི་ལྟ་སྟེ།
en: They circumambulated the Blessed, thus-gone, worthy, perfect Buddha Ratnaketu three times,

source: སྐྱེས་བུ་སྟོབས་པོ་ཆེས་ལག་པ་བསྐུམ་པ་ལས་རྐྱོང་བའམ། ལག་པ་བརྐྱང་བ་ལས་སྐུམ་པ་བཞིན་དུ་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་དེ་ཉིད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏེ།
en: and then instantaneously traveled to this Sahā world, arriving as quickly as it takes a strong person to extend and retract his arm.

source: དེ་བར་སྣང་ལ་ལུས་མི་སྣང་བར་འདུག་ནས།
en: Remaining in midair with their bodies invisible,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར།
en: they sent down a great shower of fragrant, colorful, and delightful flowers,

source: མེ་ཏོག་སྔོན་མ་མཐོང་མ་ཐོས་པ། དྲི་ཞིམ་པ་ཁ་དོག་དང་ལྡན་པ་ཡིད་དུ་འོང་བའི་ཆར་ཆེན་པོ་མངོན་པར་ཕབ་སྟེ།
en: such as had never been seen or heard of before, in order to honor the Blessed, thus-gone, worthy, perfect Buddha Śākyamuni.

source: མེ་ཏོག་གི་ཆར་ཆེན་པོ་ཕབ་པ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་པུས་མོ་ནུབ་ཙམ་དུ་གང་བར་གྱུར་ཏོ། །
en: This great shower of flowers filled the whole great trichiliocosm to knee height.

source: དེ་ནས་འཁོར་དེ་ཐམས་ཅད་མེ་ཏོག་གི་ཆར་ཆེན་པོ་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: Seeing these flowers, everyone assembled there was amazed

source: བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: and asked,

source: བཅོམ་ལྡན་འདས་སུའི་མཐུས་འདི་ལྟ་བུར་བལྟ་ན་སྡུག་པའི་མེ་ཏོག་གི་ཆར་ཆེན་པོ་མངོན་པར་ཕབ།
en: “Blessed One, who caused this great shower of blossoms, so pleasant to behold, to fall?”

source: འདི་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བཅུ་དང་འགྲོགས་ཏེ།
en: “Mañjuśrī Kumārabhuta, accompanied by ten thousand bodhisattvas,

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ནས་དེ་དག་གི་ལུས་མི་སྣང་བར་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ཕྱིར་འདི་ལྟ་བུའི་མེ་ཏོག་གི་ཆར་ཆེན་པོ་མངོན་པར་ཕབ་པོ། །
en: has come from the Jewel World to this Sahā world. With their bodies invisible, they all sent down this great shower of flowers to honor the Thus-gone One.”

source: འཁོར་དེ་དག་གིས་གསོལ་པ།
en: Those in the retinue said,

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བདག་ཅག་གིས་བལྟའོ། །
en: “Blessed One, we would like to see Mañjuśrī Kumārabhuta and those bodhisattva great beings.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བཅུ་དང་ལྷན་ཅིག་ཏུ་བར་སྣང་ལས་བབས་ཏེ།
en: At that point, Mañjuśrī Kumārabhuta and the ten thousand bodhisattvas descended from the sky.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Having prostrated at the Blessed One’s feet,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་རང་རང་གི་རྫུ་འཕྲུལ་གྱིས་སྤྲུལ་པའི་སྟན་ལ་འཁོད་དོ། །
en: Mañjuśrī Kumārabhuta and the bodhisattva great beings each sat down on their own miraculously emanated seat.

source: དེ་ནས་ལྷའི་བུ་རབ་ཏུ་ཞི་བ་རྣམ་པར་དུལ་བའི་དབང་ཕྱུག་གིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: Then the god Lord of Peace and Calm bowed to the Blessed One

source: བཅོམ་ལྡན་འདས་འཁོར་འདི་དག་ཉན་འཚལ་ན།
en: “Blessed One, all of us would like to listen,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་མཆིད་ཀྱི་རྒྱུད་འགའ་ཞིག་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སྨྲར་གསོལ།
en: so please ask Mañjuśrī Kumārabhuta to teach.”

source: ལྷའི་བུ་ཁྱོད་ཉིད་ཀྱིས་གང་འདོད་པ་དྲིས་ཤིག །ལྷའི་བུས་སྨྲས་པ།
en: “Divine son, you yourself should make that request.” So the god said,

source: འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་ཏོག་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་ཆོས་བསྟན་པ་ཇི་ལྟ་བུ་དག་འབྱུང་ན་དེར་མངོན་པར་དགའ།
en: “Mañjuśrī, it would be wonderful if you could give us a Dharma teaching similar to what is taught in the buddha realm of the Blessed, Thus-gone Ratnaketu.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī replied,

source: དོན་དམ་པར་ན་འདོད་ཆགས་བསྐྱེད་པའི་ཕྱིར་ཡང་མ་ཡིན། འདོད་ཆགས་ཟད་པར་བྱ་བའི་ཕྱིར་ཡང་མ་ཡིན་ནོ། །
en: “Ultimately, the Dharma is not about generating attachment; nor is it about bringing attachment to an end.

source: དོན་དམ་པར་ན་ཞེ་སྡང་བསྐྱེད་པའི་ཕྱིར་ཡང་མ་ཡིན། ཞེ་སྡང་ཟད་པར་བྱ་བའི་ཕྱིར་ཡང་མ་ཡིན་ནོ། །
en: Ultimately, it is not about generating anger; nor is it about bringing anger to an end.

source: དོན་དམ་པར་ན་གཏི་མུག་བསྐྱེད་པའི་ཕྱིར་ཡང་མ་ཡིན། གཏི་མུག་ཟད་པར་བྱ་བའི་ཕྱིར་ཡང་མ་ཡིན་ནོ། །
en: Ultimately, it is not about generating delusion; nor is it about bringing delusion to an end.

source: དོན་དམ་པར་ན་ཡེ་ཤེས་བསྐྱེད་པའི་ཕྱིར་ཡང་མ་ཡིན། ཡེ་ཤེས་ཟད་པར་བྱ་བའི་ཕྱིར་ཡང་མ་ཡིན་ནོ། །
en: Ultimately, it is not about generating wisdom; nor is it about bringing wisdom to an end.”

source: ལྷའི་བུས་སྨྲས་པ།
en: The god said,

source: འཇམ་དཔལ་ཅིའི་ཕྱིར།
en: “Mañjuśrī, how is that?”

source: ལྷའི་བུ་མི་སྐྱེ་བ་ལ་སྐྱེ་བའམ། ཟད་པ་གང་ཡང་མེད་དོ། །
en: “Divine son, in the unborn, there is no birth or ending whatsoever.

source: ལྷའི་བུ་དོན་དམ་པར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་རྣམ་པར་རྟོག་པ་སྐྱེས་པའམ།
en: Ultimately, divine son, the bodhisattva great beings have no thoughts at all, none that have arisen,

source: སྐྱེ་བའམ།
en: none that are arising,

source: སྐྱེ་བར་འགྱུར་བ་གང་ཡང་མེད་དོ། །
en: and none that will arise.

source: དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མ་སྐྱེས་པའི་ཕྱིར་རོ། །
en: Because ultimately all phenomena are inherently unborn.”

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དེ་ཅི་ཞིག་སྤང་བའི་ཕྱིར་ཆོས་སྟོན།
en: “Mañjuśrī, so what does that Thus-gone One wish to see abandoned through his teaching the Dharma?”

source: དོན་དམ་པར་ན་རང་བཞིན་གྱིས་མི་སྐྱེ་མི་ཟད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་སྟོན་ཏོ། །
en: “That Thus-gone One teaches the Dharma because ultimately things are neither inherently born, nor do they inherently end.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་དོན་དམ་པའི་བདེན་པ་ལ་ལྷུར་བྱེད་པ་ཡིན་གྱི་
en: Because bodhisattva great beings apply themselves assiduously to the ultimate truth.

source: ཀུན་རྫོབ་ཀྱི་བདེན་པ་ལ་ཡང་ལྷུར་བྱེད་པ་མ་ཡིན་ནོ། །
en: However, they do not apply themselves diligently to the relative truth.”

source: འཇམ་དཔལ་དོན་དམ་པའི་བདེན་པ་གང་ཡིན།
en: “Mañjuśrī, what is the ultimate truth?”

source: ལྷའི་བུ་གལ་ཏེ་དོན་དམ་པར་ན་དོན་དམ་པའི་བདེན་པ་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ཡུལ་གྱི་རང་བཞིན་དུ་འགྱུར་ན་ནི་དོན་དམ་པའི་བདེན་པ་ཞེས་བྱ་བའི་གྲངས་སུ་མི་འགྲོ་སྟེ།
en: “Divine son, if, on the ultimate level, ultimate truth becomes an object of body, speech, or mind, that is not ‘ultimate truth’

source: ཀུན་རྫོབ་ཀྱི་བདེན་པ་ཉིད་དུ་འགྱུར་རོ། །
en: but relative truth itself.

source: འོན་ཀྱང་ལྷའི་བུ་དོན་དམ་པར་ན་དོན་དམ་པའི་བདེན་པ་ནི།
en: Rather, divine son, on the ultimate level, ultimate truth transcends all conventions.

source: ཐ་སྙད་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ། བྱེ་བྲག་མེད་པ།
en: It is without specific instances;

source: མ་སྐྱེས་པ།
en: it does not arise,

source: མ་འགགས་པ།
en: does not cease,

source: སྨྲ་བར་བྱ་བ་དང་།
en: and is free from something to be expressed,

source: སྨྲ་བ་དང་།
en: an expression,

source: ཤེས་པར་བྱ་བ་དང་།
en: something to be known,

source: ཤེས་པ་དང་བྲལ་བའོ། །
en: and knowledge.

source: ལྷའི་བུ་དོན་དམ་པའི་བདེན་པ་ནི་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་གྱི་བར་ལས་ཡང་དག་པར་འདས་པ་ཡིན་ཏེ།
en: Divine son, the ultimate truth transcends everything up through the domain of omniscient wisdom that is endowed with the supreme of all aspects.

source: ལྷའི་བུ་དེ་ལ་རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་འཇུག་པའང་མེད།
en: Divine son, it has no engagement with,

source: ལྡོག་པའང་མེད་དོ། །
en: nor any turning back of, concepts and thoughts.

source: དོན་དམ་པར་ན་དེ་ལ་ཕ་རོལ་ཡང་མེད། ཚུ་རོལ་ཡང་མེད།
en: Ultimately, there is no ‘far shore,’ there is no ‘this shore,’

source: དབུས་ཀྱང་མེད་དེ།
en: nor is there a middle.

source: ལྷའི་བུ་འདི་ནི་དོན་དམ་པའི་བདེན་པ་ཞེས་སྒྲོ་བཏགས་ཏེ་བརྗོད་མོད་ཀྱི།
en: Divine son, although one indeed makes the exaggerated claim,

source: ཇི་ལྟར་དོན་དམ་པའི་བདེན་པའོ་ཞེས་བྱ་བ་ལྟར་ནི་མ་ཡིན་ནོ། །
en: ‘This is ultimate truth,’ that is not the same as saying, ‘Ultimate truth is like this.’

source: ལྷའི་བུ་དོན་ནི་དོན་དམ་པར་མི་སྐྱེ་བ་སྟེ།
en: Divine son, ultimately, reality is unborn;

source: དེ་ལ་ཐ་སྙད་ཐམས་ཅད་མི་འཇུག་གོ། །
en: thus, no conventions apply to it.

source: དོན་དམ་པར་གང་ལ་ཐ་སྙད་ཐམས་ཅད་མི་འཇུག་པ་དེ་ནི་ལྷའི་བུ་དོན་དམ་པའི་བདེན་པ་སྟེ། ཇི་ལྟར་དོན་དམ་པའི་བདེན་པའོ། །
en: That to which, on the ultimate level, no conventions apply, divine son, is ultimate truth.

source: ཞེས་བརྗོད་པ་ལྟར་ན་མ་ཡིན་ནོ། །
en: Thus, that is not like saying,

source: ལྷའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཀྱང་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་དང་།
en: ‘Ultimate truth is like this.’ Divine son, the Thus-gone, worthy, perfect Buddha also says that ultimately all phenomena

source: སྒྲ་ཐམས་ཅད་ནི་བརྫུན་ཏེ་སླུ་བའི་ཆོས་སོ་ཞེས་བཀའ་སྩལ་ཏོ། །
en: and all terms are false and deceptive phenomena.”

source: འཇམ་དཔལ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་བཤད་པ་དེ་བརྫུན་དུ་མི་འགྱུར་རམ།
en: “How is it then, Mañjuśrī, that the Dharma taught by the Thus-gone One is not false?”

source: ལྷའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་དོན་དམ་པར་ན་བརྫུན་དུའང་མི་འཆད།
en: “Divine son, on the ultimate level, the Thus-gone One does not speak falsely.

source: བདེན་པར་ཡང་མི་འཆད་དོ། །
en: Nor does he speak truly.

source: ལྷའི་བུ་དོན་དམ་པར་ན་དེ་བཞིན་གཤེགས་པ་ནི་མ་སྐྱེས་པ་སྟེ།
en: Ultimately, divine son, the Thus-gone One has not arisen.

source: དེ་དོན་དམ་པར་ན་བདེན་པ་དང་བརྫུན་པར་མི་འཆད་དོ། །
en: And so, ultimately he speaks neither falsely nor truly.

source: ལྷའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས།
en: Divine son, what do you think?

source: དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པས་བཤད་པ་དེ་བདེན་ནམ་འོན་ཏེ་བརྫུན།
en: Are explanations given by magical creations of the Thus-gone One true or false?”

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་སྤྲུལ་པས་བཤད་པ་ནི་བདེན་པའང་མ་ཡིན་བརྫུན་པའང་མ་ཡིན་ནོ། །
en: “Mañjuśrī, explanations given by magical creations of the Thus-gone One are not true, nor are they false.

source: འཇམ་དཔལ་དོན་དམ་པར་ན་དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པ་ལ་ཡང་དག་པར་ཡོངས་སུ་གྲུབ་པ་གང་ཡང་མེད་དོ། །
en: Mañjuśrī, ultimately there is nothing truly established in that which is emanated by the Thus-gone One.”

source: ལྷའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: “Divine son, so it is.

source: དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་གྲུབ་པར་མཁྱེན་ཏོ། །
en: The Thus-gone One knows that all phenomena are unestablished in the ultimate sense.

source: གང་དོན་དམ་པར་ཡོངས་སུ་མ་གྲུབ་པ་དེ་ནི་དོན་དམ་པར་ན་བདེན་པ་ཞེས་ཀྱང་མི་བྱ།
en: Whatever is unestablished in the ultimate sense should not be called true

source: བརྫུན་པ་ཞེས་ཀྱང་མི་བྱའོ། །
en: nor should it be called false in the context of the ultimate.

source: དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པའི་ཕྱིར་རོ། །
en: Because ultimately all phenomena are unborn.”

source: ཅི་འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དོན་དམ་པའི་བདེན་པ་སྟོན་ཏམ།
en: “Mañjuśrī, how does the Thus-gone One teach the ultimate truth?”

source: ལྷའི་བུ་དོན་དམ་པའི་བདེན་པ་ནི་བསྟན་པར་མི་ནུས་སོ། །
en: “The ultimate truth, divine son, cannot be taught.

source: གང་སྟོན་པ་དང་
en: Because the topic,

source: གང་གིས་སྟོན་པ་དང་
en: the teacher,

source: ཅི་སྟོན་པ་དང་།
en: the method of teaching,

source: གང་ལ་སྟོན་པ་དང་།
en: the student,

source: ཅིའི་ཕྱིར་སྟོན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་དོན་དམ་པར་ན་རབ་ཏུ་མ་སྐྱེས་པའོ། །
en: and the reason for teaching are all ultimately utterly unborn.

source: རབ་ཏུ་མ་སྐྱེས་པའི་ཆོས་རྣམས་ཀྱིས་ནི་རབ་ཏུ་མ་སྐྱེས་པའི་ཆོས་རྣམས་བཤད་མི་ནུས་སོ། །
en: Phenomena that are utterly unborn cannot themselves express utterly unborn phenomena.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དོན་དམ་པའི་བདེན་པ་བསྟན་པ་འདི་མི་སྟོན་པའི་ཚུལ་གྱིས་བསྟན་པ་ན་
en: When Mañjuśrī Kumārabhuta had given this teaching on the ultimate truth without teaching,

source: དགེ་སློང་ལྔ་བརྒྱ་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: the minds of five hundred monks were freed from defilements without further clinging.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བགྲང་བ་ལས་འདས་པ་རྣམས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་མ་སྐྱེས་པའི་ཚུལ་གྱིས་བཟོད་པ་སྐྱེས་སོ། །
en: Countless bodhisattva great beings developed, without developing it, the acceptance that phenomena are unborn.

source: འཇམ་དཔལ་དོན་དམ་པའི་བདེན་པ་ལ་མོས་པར་དཀའོ། །
en: “Mañjuśrī, it is difficult to feel conviction in the ultimate truth.”

source: ལྷའི་བུ་དོན་དམ་པའི་བདེན་པ་ལ་ནི་དམིགས་པ་ཅན་ཐམས་ཅད་ཀྱིས་མོས་པར་དཀའོ། །
en: “Divine son, it is difficult for anyone who relies on reference points to feel conviction in the ultimate truth.”

source: འཇམ་དཔལ་དོན་དམ་པའི་བདེན་པ་ཁོང་དུ་ཆུད་པར་དཀའོ། །
en: “Mañjuśrī, it is difficult to understand the ultimate truth.”

source: ལྷའི་བུ་མི་བརྩོན་པས་དོན་དམ་པའི་བདེན་པ་ཁོང་དུ་ཆུད་པར་དཀའོ། །
en: “Divine son, it is difficult for those who do not exert themselves to understand the ultimate truth.”

source: འཇམ་དཔལ་ཇི་ལྟར་ན་དགེ་སློང་མངོན་པར་བརྩོན་པ་ཡིན།
en: “Mañjuśrī, how do monks exert themselves?”

source: ལྷའི་བུ་དོན་དམ་པར་ན་ནམ་ཡོངས་སུ་ཤེས་པ་དང་།
en: “Divine son, ultimately, when they are without exertion that aims to understand,

source: སྤང་བ་དང་།
en: relinquish,

source: བསྒོམ་པ་དང་།
en: cultivate,

source: མངོན་དུ་བྱ་བའི་ཕྱིར་
en: or actualize,

source: བརྩོན་པར་མ་གྱུར་ན་ལྷའི་བུ་དེ་ལྟར་དགེ་སློང་མི་བརྩོན་པའི་ཚུལ་གྱིས་མངོན་པར་བརྩོན་པ་ཡིན་ནོ། །
en: that is how monks exert themselves without exerting themselves.

source: གང་འདི་སྙམ་དུ་དོན་དམ་པར་འདི་ཡོངས་སུ་ཤེས་པར་བྱའོ། །
en: Because one might think, ‘Ultimately, this is to be understood,

source: འདི་སྤང་བར་བྱའོ། །
en: this is to be relinquished,

source: འདི་བསྒོམ་པར་བྱའོ། །
en: this is to be cultivated,

source: འདི་མངོན་དུ་བྱའོ་
en: and this is to be actualized.’

source: སྙམ་དུ་སེམས་པའི་སྦྱོར་བ་དེ་ནི་མཚན་མ་དང་བཅས་པ།
en: However, such thinking involves conceptual marks

source: སྤྲོས་པ་དང་བཅས་པ།
en: and elaborations.

source: དམིགས་པ་དང་བཅས་པ།
en: It involves reference points

source: ཉོན་མོངས་པ་དང་བཅས་པ།
en: and disturbing emotions.

source: འཁྲུག་པ་དང་བཅས་པ།
en: It involves tumult

source: འཇིགས་པ་དང་བཅས་པ།
en: and fear.

source: ནད་དང་བཅས་པ།
en: It involves illness

source: སྡུག་བསྔལ་དང་བཅས་པ།
en: and suffering.

source: ཟུག་རྔུ་དང་བཅས་པ།
en: It involves pain

source: དུག་དང་བཅས་པ་སྟེ།
en: and poison.

source: དེའི་སྦྱོར་བ་དེ་ནི་ཡང་དག་པ་མ་ཡིན་ནོ། །
en: Thus, engagement of that type is not authentic.”

source: འཇམ་དཔལ་ཡང་དག་པར་སྦྱོར་བ་ནི་གང་ཡིན།
en: “Mañjuśrī, what is authentic engagement?”

source: ལྷའི་བུ་དོན་དམ་པར་ན་དེ་བཞིན་ཉིད་དང་།
en: “Divine son, whatever is the same as suchness,

source: ཆོས་ཀྱི་དབྱིངས་དང་།
en: the sphere of reality,

source: ཤིན་ཏུ་མི་སྐྱེ་བ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་མཚམས་མེད་པ་ལྔ་པོ་དག་ཀྱང་དེ་དང་མཉམ་མོ། །
en: and the utterly unborn on the ultimate level is also the same as the five acts with immediate consequence on the ultimate level.

source: དོན་དམ་པར་ན་དེ་བཞིན་ཉིད་དང་།
en: “Whatever is the same as suchness,

source: ཤིན་ཏུ་མི་སྐྱེ་བ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་ལྟ་བར་གྱུར་པ་རྣམས་ཀྱང་དེ་དང་མཉམ་མོ། །
en: and the utterly unborn on the ultimate level is also ultimately the same as views.

source: ཤིན་ཏུ་མི་སྐྱེ་བ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱང་དེ་དང་མཉམ་མོ། །
en: and the utterly unborn on the ultimate level is also ultimately the same as the dharmas of ordinary beings.
